Omkar7637/NXP-S32K344-Development-/MCSPTE1AK344_BLDC_6Step_hall_ll/board/Siul2_Port_Ip_Cfg.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7 
*   Platform             : CORTEXM
*   Peripheral           : SIUL2
*   Dependencies         : none
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 3.0.0
*   Build Version        : S32K3_AUTOSAR_4_4_-_R21-11_RTD_3_0_0_D2303_ASR_REL_4_7_REV_0000_20230331
*
*   Copyright 2020 - 2023 NXP Semiconductors
*
*   NXP Confidential. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

#ifndef SIUL2_PORT_IP_CFG_H
#define SIUL2_PORT_IP_CFG_H

/**
*   @file      Siul2_Port_Ip_Cfg.h
*
*   @addtogroup Port_CFG
*   @{
*/

#ifdef __cplusplus
extern "C"{
#endif


/*==================================================================================================
                                         INCLUDE FILES
 1) system and project includes
 2) needed interfaces from external units
 3) internal and external interfaces from this unit
==================================================================================================*/
#include "S32K344_SIUL2.h"
#include "Siul2_Port_Ip_Types.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define SIUL2_PORT_IP_VENDOR_ID_CFG_H                       43
#define SIUL2_PORT_IP_AR_RELEASE_MAJOR_VERSION_CFG_H        4
#define SIUL2_PORT_IP_AR_RELEASE_MINOR_VERSION_CFG_H        7
#define SIUL2_PORT_IP_AR_RELEASE_REVISION_VERSION_CFG_H     0
#define SIUL2_PORT_IP_SW_MAJOR_VERSION_CFG_H                3
#define SIUL2_PORT_IP_SW_MINOR_VERSION_CFG_H                0
#define SIUL2_PORT_IP_SW_PATCH_VERSION_CFG_H                0

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if the files Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h are of the same version */
#if (SIUL2_PORT_IP_VENDOR_ID_CFG_H != SIUL2_PORT_IP_TYPES_VENDOR_ID_H)
    #error "Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h have different vendor ids"
#endif
/* Check if Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h are of the same Autosar version */
#if ((SIUL2_PORT_IP_AR_RELEASE_MAJOR_VERSION_CFG_H    != SIUL2_PORT_IP_TYPES_AR_RELEASE_MAJOR_VERSION_H) || \
     (SIUL2_PORT_IP_AR_RELEASE_MINOR_VERSION_CFG_H    != SIUL2_PORT_IP_TYPES_AR_RELEASE_MINOR_VERSION_H) || \
     (SIUL2_PORT_IP_AR_RELEASE_REVISION_VERSION_CFG_H != SIUL2_PORT_IP_TYPES_AR_RELEASE_REVISION_VERSION_H) \
    )
    #error "AutoSar Version Numbers of Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h are different"
#endif
/* Check if Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h are of the same Software version */
#if ((SIUL2_PORT_IP_SW_MAJOR_VERSION_CFG_H != SIUL2_PORT_IP_TYPES_SW_MAJOR_VERSION_H) || \
     (SIUL2_PORT_IP_SW_MINOR_VERSION_CFG_H != SIUL2_PORT_IP_TYPES_SW_MINOR_VERSION_H) || \
     (SIUL2_PORT_IP_SW_PATCH_VERSION_CFG_H != SIUL2_PORT_IP_TYPES_SW_PATCH_VERSION_H)    \
    )
    #error "Software Version Numbers of Siul2_Port_Ip_Cfg.h and Siul2_Port_Ip_Types.h are different"
#endif
/*==================================================================================================
                                           CONSTANTS
==================================================================================================*/

/*==================================================================================================
                                      DEFINES AND MACROS
==================================================================================================*/
#define SIUL2_MSCR_SSS_MASK                      (0xFU)
#define SIUL2_MSCR_SSS_SHIFT                     (0U)
#define SIUL2_MSCR_SSS_WIDTH                     (4U)
#define SIUL2_MSCR_SSS(x)                        (((uint32)(((uint32)(x)) << SIUL2_MSCR_SSS_SHIFT)) & SIUL2_MSCR_SSS_MASK)

#define SIUL2_MSCR_SRE_MASK                      (0x4000U)
#define SIUL2_MSCR_SRE_SHIFT                     (14U)
#define SIUL2_MSCR_SRE_WIDTH                     (1U)
#define SIUL2_MSCR_SRE(x)                        (((uint32)(((uint32)(x)) << SIUL2_MSCR_SRE_SHIFT)) & SIUL2_MSCR_SRE_MASK)


/*! @brief Definitions for BOARD_InitPins Functional Group */

/*! @brief User number of configured pins */
#define NUM_OF_CONFIGURED_PINS0 29

#define PORT_START_SEC_CONFIG_DATA_UNSPECIFIED
#include "Port_MemMap.h"

/*! @brief User configuration structure */
extern const Siul2_Port_Ip_PinSettingsConfig g_pin_mux_InitConfigArr0[NUM_OF_CONFIGURED_PINS0];

#define PORT_STOP_SEC_CONFIG_DATA_UNSPECIFIED
#include "Port_MemMap.h"

/*! @brief Defines for user pin and port configurations */
#define PWMC_LS_PIN             0u
#define PWMC_LS_PORT            PTA_L_HALF
#define PWMC_HS_PIN             1u
#define PWMC_HS_PORT            PTA_L_HALF
#define PWMB_HS_PIN             2u
#define PWMB_HS_PORT            PTA_L_HALF
#define PWMB_LS_PIN             3u
#define PWMB_LS_PORT            PTA_L_HALF
#define FMSTR_RX_PIN            15u
#define FMSTR_RX_PORT           PTA_L_HALF
#define FMSTR_TX_PIN            0u
#define FMSTR_TX_PORT           PTA_H_HALF
#define LED_RED_PIN             13u
#define LED_RED_PORT            PTA_H_HALF
#define LED_GREEN_PIN           14u
#define LED_GREEN_PORT          PTA_H_HALF
#define LED_BLUE_PIN            15u
#define LED_BLUE_PORT           PTA_H_HALF
#define GD3000_EN_PIN           12u
#define GD3000_EN_PORT          PTB_L_HALF
#define GD3000_RST_PIN          13u
#define GD3000_RST_PORT         PTB_L_HALF
#define GD3000_CLK_PIN          14u
#define GD3000_CLK_PORT         PTB_L_HALF
#define GD3000_SIN_PIN          15u
#define GD3000_SIN_PORT         PTB_L_HALF
#define GD3000_SOUT_PIN         0u
#define GD3000_SOUT_PORT        PTB_H_HALF
#define GD3000_CS_PIN           1u
#define GD3000_CS_PORT          PTB_H_HALF
#define TST_TGMX_O9_B18_PIN     2u
#define TST_TGMX_O9_B18_PORT    PTB_H_HALF
#define BTN_DEC_SW6_PIN         3u
#define BTN_DEC_SW6_PORT        PTB_H_HALF
#define TST_GPIO_B20_PIN        4u
#define TST_GPIO_B20_PORT       PTB_H_HALF
#define TST_TGMX_O12_B21_PIN    5u
#define TST_TGMX_O12_B21_PORT   PTB_H_HALF
#define BTN_INC_SW5_PIN         10u
#define BTN_INC_SW5_PORT        PTB_H_HALF
#define GD3000_INT_PIN          7u
#define GD3000_INT_PORT         PTC_L_HALF
#define TST_GPIO_C24_PIN        8u
#define TST_GPIO_C24_PORT       PTC_H_HALF
#define PWMA_HS_PIN             2u
#define PWMA_HS_PORT            PTD_L_HALF
#define PWMA_LS_PIN             3u
#define PWMA_LS_PORT            PTD_L_HALF
#define HALL_A_PIN              3u
#define HALL_A_PORT             PTA_H_HALF
#define HALL_B_PIN              4u
#define HALL_B_PORT             PTA_H_HALF
#define DCB_V_PIN               0u
#define DCB_V_PORT              PTD_L_HALF
#define DCB_I_PIN               1u
#define DCB_I_PORT              PTD_L_HALF
#define HALL_C_PIN              5u
#define HALL_C_PORT             PTA_H_HALF

/*==================================================================================================
                                           ENUMS
==================================================================================================*/

/*==================================================================================================
                               STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
                               GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
                               FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* SIUL2_PORT_IP_CFG_H */

